#연산자 2항 연산자 & 3항 연산자

# < > <= == + - / %

#name = 조건문 ? True일때 값 : False 일때

num1 = 1
num2 = 3

# 3항 연산자는 C / JAVA / JS  //// c에서는 조건 ? 참일 때 값 : 거짓일 때 값.
# 대입할 변수 = 참일때의 값 if (조건) else 거짓일때 값

result = 100 if num1>=num2 else 200

#변수 = 프로그래밍 언어에서 다 등장을하고 구현하는 방식은 조금씩 차이가 있을지 몰라도 무조건 특정 자료를 담는다.

user_in = input()

# 시험x 객체 프로그래밍 << 요 개념은 알고계시면 좋은데 제가 설명드리기에는 너무 복잡하고 1-2 컴퓨터 프로그래밍 및 실습 (박상원 교수님)

# 절차 지향 vs 객체 지향 프로그래밍의 차이를 알고 계시면 좋을 것 같다.

#  C 시스템 프로그래밍에 친화되어 있는 언어
# python = 

#(a == b) == (a is b)

# is / ==  or / || and / &&